---
title: ParameterDownloadOptions
classe: Autodesk.Revit.DB.ParameterDownloadOptions
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 8
---

# ParameterDownloadOptions

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsInstance { get; set; }` | `parameterDownloadOptions.IsInstance` | Boolean |
| `Boolean IsValidObject { get; }` | `parameterDownloadOptions.IsValidObject` | Boolean |
| `Boolean Visible { get; set; }` | `parameterDownloadOptions.Visible` | Boolean |
| `Void Dispose()` | `parameterDownloadOptions.Dispose()` | Void |
| `ISet<ElementId> GetCategories()` | `parameterDownloadOptions.GetCategories()` | ISet<ElementId> |
| `ForgeTypeId GetGroupTypeId()` | `parameterDownloadOptions.GetGroupTypeId()` | ForgeTypeId |
| `Void SetCategories(ISet<ElementId>)` | `parameterDownloadOptions.SetCategories(categories)` | Void |
| `Void SetGroupTypeId(ForgeTypeId)` | `parameterDownloadOptions.SetGroupTypeId(groupTypeId)` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```